"use client";

import PaginationFeature from '@/components/PaginationFeature'
import { usePathname } from 'next/navigation';

const mockData = [{
    "หัวข้อ": "บทความที่ 1",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-01",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์เอ"
  },
  {
    "หัวข้อ": "บทความที่ 2",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-02",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์บี"
  },
  {
    "หัวข้อ": "บทความที่ 3",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-03",
    "วันที่บทความสมบูรณ์": "2025-08-10",
    "ผู้ตรวจ": "อาจารย์ซี"
  },
  {
    "หัวข้อ": "บทความที่ 4",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-04",
    "วันที่บทความสมบูรณ์": "2025-08-12",
    "ผู้ตรวจ": "อาจารย์ดี"
  },
  {
    "หัวข้อ": "บทความที่ 5",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-05",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์อี"
  },
  {
    "หัวข้อ": "บทความที่ 6",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-06",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์เอ"
  },
  {
    "หัวข้อ": "บทความที่ 7",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-07",
    "วันที่บทความสมบูรณ์": "2025-08-18",
    "ผู้ตรวจ": "อาจารย์บี"
  },
  {
    "หัวข้อ": "บทความที่ 8",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-08",
    "วันที่บทความสมบูรณ์": "2025-08-20",
    "ผู้ตรวจ": "อาจารย์ซี"
  },
  {
    "หัวข้อ": "บทความที่ 9",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-09",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์ดี"
  },
  {
    "หัวข้อ": "บทความที่ 10",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-10",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์อี"
  },
  {
    "หัวข้อ": "บทความที่ 11",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-11",
    "วันที่บทความสมบูรณ์": "2025-08-27",
    "ผู้ตรวจ": "อาจารย์เอ"
  },
  {
    "หัวข้อ": "บทความที่ 12",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-12",
    "วันที่บทความสมบูรณ์": "2025-08-30",
    "ผู้ตรวจ": "อาจารย์บี"
  },
  {
    "หัวข้อ": "บทความที่ 13",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-13",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์ซี"
  },
  {
    "หัวข้อ": "บทความที่ 14",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-14",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์ดี"
  },
  {
    "หัวข้อ": "บทความที่ 15",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-15",
    "วันที่บทความสมบูรณ์": "2025-09-04",
    "ผู้ตรวจ": "อาจารย์อี"
  },
  {
    "หัวข้อ": "บทความที่ 16",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-16",
    "วันที่บทความสมบูรณ์": "2025-09-06",
    "ผู้ตรวจ": "อาจารย์เอ"
  },
  {
    "หัวข้อ": "บทความที่ 17",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-17",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์บี"
  },
  {
    "หัวข้อ": "บทความที่ 18",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-18",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์ซี"
  },
  {
    "หัวข้อ": "บทความที่ 19",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-19",
    "วันที่บทความสมบูรณ์": "2025-09-12",
    "ผู้ตรวจ": "อาจารย์ดี"
  },
  {
    "หัวข้อ": "บทความที่ 20",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-20",
    "วันที่บทความสมบูรณ์": "2025-09-14",
    "ผู้ตรวจ": "อาจารย์อี"
  },
  {
    "หัวข้อ": "บทความที่ 21",
    "สถานะ": "กำลังตรวจ",
    "วันที่อัปโหลด": "2025-08-21",
    "วันที่บทความสมบูรณ์": "",
    "ผู้ตรวจ": "อาจารย์เอ"
  },
  {
    "หัวข้อ": "บทความที่ 22",
    "สถานะ": "ต้องเเก้ไข",
    "วันที่อัปโหลด": "2025-08-22",
    "วันที่บทความสมบูรณ์": "-",
    "ผู้ตรวจ": "อาจารย์บี"
  },
  {
    "หัวข้อ": "บทความที่ 23",
    "สถานะ": "ข้อมูลสมบูรณ์",
    "วันที่อัปโหลด": "2025-08-23",
    "วันที่บทความสมบูรณ์": "2025-09-20",
    "ผู้ตรวจ": "อาจารย์ซี"
  },
  {
    "หัวข้อ": "บทความที่ 24",
    "สถานะ": "เสร็จสิ้น",
    "วันที่อัปโหลด": "2025-08-24",
    "วันที่บทความสมบูรณ์": "2025-09-22",
    "ผู้ตรวจ": "อาจารย์ดี"
  }
]


const MyHistoryPage = () => {

  const path =  usePathname();
  return (
    <div className="w-full flex flex-col justify-center items-center px-4 py-10">
      <div className="w-full max-w-(--8xl) flex flex-col justify-between items-center">
        <div className="w-full flex flex-row justify-between items-center my-5">
          <p className="text-3xl">ประวัติบทความ</p>
          <div className="flex flex-row gap-2">
           
            <div className="w-xs">
              <select defaultValue="เรียงตามผลงานล่าสุด" className="select">
                <option disabled={true}>เรียงตามผลงานล่าสุด</option>
                <option>เรียงตามผลงานล่าสุด</option>
                <option>Amber</option>
                <option>Velvet</option>
              </select>
            </div>
          </div>
        </div>

        <PaginationFeature pathName={path} mockData={mockData} rowsValue={15}  />

      </div>
    </div>
  );
};

export default MyHistoryPage;