"use client";
import { Pagination } from "@mui/material";
import { usePathname } from 'next/navigation'
import { Suspense, useState } from "react";
import PaginationFeature from "@/components/PaginationFeature"
import Loading from "../loading";

//จำลองข้อมูล API
const mockData = [
  { หัวข้อ: "ผู้หญิงมีจริงหรือไม่", วันที่อัปโหลด: "30/08/2568", ปีที่พิมพ์: "2505", ประเภท: "วารสาร", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "พลังงานทดแทนในอนาคต", วันที่อัปโหลด: "01/09/2568", ปีที่พิมพ์: "2560", ประเภท: "งานวิจัย", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "การพัฒนาปัญญาประดิษฐ์", วันที่อัปโหลด: "02/09/2568", ปีที่พิมพ์: "2566", ประเภท: "วิทยานิพนธ์", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "ผลกระทบโลกร้อน", วันที่อัปโหลด: "03/09/2568", ปีที่พิมพ์: "2555", ประเภท: "รายงาน", สถานะ: "เสร็จสิ้น" },
  { หัวข้อ: "วิทยาศาสตร์อาหาร", วันที่อัปโหลด: "04/09/2568", ปีที่พิมพ์: "2558", ประเภท: "วารสาร", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "โครงข่ายประสาทเทียม", วันที่อัปโหลด: "05/09/2568", ปีที่พิมพ์: "2564", ประเภท: "งานวิจัย", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "พฤติกรรมผู้บริโภคยุคดิจิทัล", วันที่อัปโหลด: "06/09/2568", ปีที่พิมพ์: "2559", ประเภท: "วารสาร", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "เศรษฐกิจสร้างสรรค์", วันที่อัปโหลด: "07/09/2568", ปีที่พิมพ์: "2557", ประเภท: "วิทยานิพนธ์", สถานะ: "เสร็จสิ้น" },
  { หัวข้อ: "ผลของการออกกำลังกาย", วันที่อัปโหลด: "08/09/2568", ปีที่พิมพ์: "2562", ประเภท: "งานวิจัย", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "ระบบขนส่งอัจฉริยะ", วันที่อัปโหลด: "09/09/2568", ปีที่พิมพ์: "2563", ประเภท: "รายงาน", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "วรรณคดีไทยสมัยใหม่", วันที่อัปโหลด: "10/09/2568", ปีที่พิมพ์: "2554", ประเภท: "วารสาร", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "ความปลอดภัยทางไซเบอร์", วันที่อัปโหลด: "11/09/2568", ปีที่พิมพ์: "2567", ประเภท: "วิทยานิพนธ์", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "การออกแบบ UX/UI", วันที่อัปโหลด: "12/09/2568", ปีที่พิมพ์: "2561", ประเภท: "รายงาน", สถานะ: "เสร็จสิ้น" },
  { หัวข้อ: "ผลกระทบโซเชียลมีเดีย", วันที่อัปโหลด: "13/09/2568", ปีที่พิมพ์: "2565", ประเภท: "งานวิจัย", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "การจัดการขยะพลาสติก", วันที่อัปโหลด: "14/09/2568", ปีที่พิมพ์: "2553", ประเภท: "วารสาร", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "การเรียนรู้แบบออนไลน์", วันที่อัปโหลด: "15/09/2568", ปีที่พิมพ์: "2560", ประเภท: "วิทยานิพนธ์", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "การท่องเที่ยวเชิงวัฒนธรรม", วันที่อัปโหลด: "16/09/2568", ปีที่พิมพ์: "2552", ประเภท: "รายงาน", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "ผลกระทบโควิด-19", วันที่อัปโหลด: "17/09/2568", ปีที่พิมพ์: "2563", ประเภท: "งานวิจัย", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "การจัดการทรัพยากรน้ำ", วันที่อัปโหลด: "18/09/2568", ปีที่พิมพ์: "2556", ประเภท: "วารสาร", สถานะ: "เสร็จสิ้น" },
  { หัวข้อ: "ระบบสมองกลฝังตัว", วันที่อัปโหลด: "19/09/2568", ปีที่พิมพ์: "2564", ประเภท: "วิทยานิพนธ์", สถานะ: "ต้องเเก้ไข" },
  { หัวข้อ: "พลังงานแสงอาทิตย์", วันที่อัปโหลด: "20/09/2568", ปีที่พิมพ์: "2551", ประเภท: "งานวิจัย", สถานะ: "ข้อมูลสมบูรณ์" },
  { หัวข้อ: "การเกษตรอัจฉริยะ", วันที่อัปโหลด: "21/09/2568", ปีที่พิมพ์: "2562", ประเภท: "รายงาน", สถานะ: "กำลังตรวจ" },
  { หัวข้อ: "พฤติกรรมการนอน", วันที่อัปโหลด: "22/09/2568", ปีที่พิมพ์: "2550", ประเภท: "วารสาร", สถานะ: "เสร็จสิ้น" },
  { หัวข้อ: "การเงินดิจิทัล", วันที่อัปโหลด: "23/09/2568", ปีที่พิมพ์: "2561", ประเภท: "วิทยานิพนธ์", สถานะ: "ต้องเเก้ไข" }
];

const ArticlemanagementPage = () => { 
  const pathName = usePathname();

  return (
    <div className="w-full flex flex-col justify-center items-center px-4 py-10">
      <div className="w-full max-w-(--8xl) flex flex-col justify-between items-center">
        <div className="w-full flex flex-row justify-between items-center my-5">
          <p className="text-3xl">บทความของฉัน</p>
          <div className="flex flex-row gap-2">
            <button className="btn btn-success rounded-xl">เพิ่มบทความ</button>
            <div className="w-xs">
              <select defaultValue="เรียงตามผลงานล่าสุด" className="select">
                <option disabled={true}>เรียงตามผลงานล่าสุด</option>
                <option>เรียงตามผลงานล่าสุด</option>
                <option>Amber</option>
                <option>Velvet</option>
              </select>
            </div>  
          </div>
        </div>
      
        <PaginationFeature pathName={pathName} mockData={mockData} rowsValue={11} />
      </div>
    </div>
  );
};

export default ArticlemanagementPage;
